---
kind: method
id: M:Autodesk.Revit.DB.CompoundStructure.GetMinimumLayerThickness
source: html/e2785666-33ac-105e-cf2a-a5f4bff43b4f.htm
---
# Autodesk.Revit.DB.CompoundStructure.GetMinimumLayerThickness Method

Get the minimum allowable layer thickness.

## Syntax (C#)
```csharp
public static double GetMinimumLayerThickness()
```

## Returns
The minimum allowable width of a layer in feet.